{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/redstone-gauges-and-switches/",
  "promos": {
    "1.12.2-recommended": "1.1.7",
    "1.12.2-latest": "1.1.8-b1",
    "1.14.4-recommended": "",
    "1.14.4-latest": "1.1.8-b2"
  },
  "1.12.2": {
    "1.1.8-b1": "[M] Industrial door contact mat model changed.\n[M] Industrial sensitive contact mat model changed.\n[M] Industrial shock sensitive contact mat model changed.\n[M] Industrial cased link receiver models changed.\n[M] Industrial block detector model changed.\n[M] Industrial trapdoor switch models changed.\n[M] Industrial dimmer model changed.",
    "1.1.7": "[R] Release build v1.1.7. Release-to-release changes: * Entity detectors have configurable on-time. * Pulse time config and switch linking with right click. * Switch scheduling performance. * Model improvments and refractoring. * JEI integration.",
    "1.1.7-b3": "[M] Added right-click switch configuration with Redstone Dust, Ender Pearl or Switch Link Pearl. (can be opt'ed out in the config if needed). Tackles issue #9.",
    "1.1.7-b2": "[A] Entity detectors have now a configurable on-time (redstone stack config like pulse switches).\n[M] Pulse switch scheduling adapted to compensate for world time alterations (issue #9).",
    "1.1.7-b1": "[M] Locations/names of all models adapted and model permutations separated from Forge blockstate format for compliant 1.14 porting.\n[A] JEI integration skel added for extended config options.\n[M] Industrial bistable switch models/textures updated.",
    "1.1.6": "[R] Release build v1.1.6\n[M] Model display rotations/translations of all blocks for GUI, 1st/3rd person improved.",
    "1.1.5": "[R] Release build based on v1.1.5-b1",
    "1.1.5-b1": "[M] Lang files ch_cn updated by scikirbypoke.",
    "1.1.4": "[R] Release build based on v1.1.4-b1: * Linking issue fixed. * Rain sensor fixed. * Optifine fixes.",
    "1.1.4-b1": "[F] Fixed linking issue when the game time is stopped (thanks to mrossi80).\n[F] Fixed rain sensor trigger condition.\n[F] Fixed optifine gauge model issues (thanks mike linn).",
    "1.1.3": "[R] Release build.\n[F] Glass ambient occlusion fixed.",
    "1.1.3-b1": "[F] Fixed cyclic switch destruction issue.\n[A] Entity detector switches can now also trigger on objects/items.\n[A] Tile entity name data fixer added (for version transitions).",
    "1.1.2": "[R] Release based on v1.1.2-b2.",
    "1.1.2-b2": "[M] Indicator blinking is client side only (using texture animations, it was overdue to keep this away from the server).\n[A] Added gauges color tinting support (left click with dye like switches).\n[A] Added industrial, color tintable, white LED indicator (dye left click).\n[A] Added rustic flag semaphore indicator.",
    "1.1.2-b1": "[A] Added Cased switch link receiver (bistable, silent, full-block).\n[A] Added Cased pulse switch link receiver (pulse, silent, full-block).\n[A] Manual dimmer switch added (industrial vertical slide, 0 to 15).\n[M] Switches and gauge do not get washed off by fluids.\n[M] Faint config click sound added (applies to all switches).",
    "1.1.1": "[R] Release based on v1.1.1-b2.",
    "1.1.1-b2": "[M] Recipe of glass gauge changed to be crafted with a glass block.\n[A] Block detection switch added (configurable range, category filter, match threshold, debounce, output power). Filters are e.g. \"solid\", \"fluid\", \"air\", \"stone\", \"soil\", \"wooden\", \"plant\", \"crop\", \"mature crop\", and other ore dict based categories. Recipe similar to the entity detection switch.\n[M] German language file updated.",
    "1.1.1-b1": "[F] Fixed block notification issue when destroying contact plates while standing on them.\n[M] Performance for redstone block updates of switches improved (update of affected blocks only).\n[A] Subsystem for full block switches with configurable output sides implemented.\n[A] Accepted wrenches (default: redstone torch) allow to configure switch outputs with a single (activation) right click in addition to empty handed left-double-click. (Feature added for creative mode and configuration of many switches).",
    "1.1.0": "[R] Release based on v1.1.0-b4.",
    "1.1.0-b4": "[A] Added recipe system based opt-out (intended to facilitate mod packing); added optionally omitting registration of opt'ed out features (for trouble shooting and development).\n[A] Added with-experimental opt-in config.\n[A] Added mod specific registration and config based recipe condition.\n[M] Indicator state range reduced (RAM/performance optimisation).\n[M] Internal changes to prepare future mod features (see repository).",
    "1.1.0-b3": "[A] Added manual/description tooltips for all blocks and items of the mod (CTRL-SHIFT when mouse hovering in the inventory or JEI).",
    "1.1.0-b2": "[A] Added switch link relay (redstone power based link activation).\n[A] Added switch link pulse relay (reacts on redstone rising edge).\n[A] Added switch link receiver (silent bistable switch device).\n[A] Added switch link pulse receiver (silent pulse switch device).\n[A] Added yellow and red power plants (yes, flowers).",
    "1.1.0-b1": "[U] Forge dependency update from v14.23.3.2655 to v14.23.5.2768, gradle updated to v3.3, mappings update to version stable_39.\n[!] Forge deprecation fixes, THIS MAY AFFECT EXISTING SWITCHES.\n[!] Structured config file implemented. THIS WILL RESET YOUR MOD CONFIG TO THE DEFAULTS.\n[A] Version update check (Forge update json file format).\n[A] Mod jar signing implemented.\n[M] Version naming compliancy (removed 'mc' prefix in version strings).\n[M] Forge naming convention refractoring of classes.",
    "1.0.5": "[R] Release based on v1.0.5b2.",
    "1.0.5-b2": "[F] Debounced link pearl cycling when creating a link pearl from an Ender pearl.\n[A] Added inverse output state switch linking feature.",
    "1.0.5-b1": "[A] Added switch linking subsystem.\n[A] Added switch link pearl, used to link and remote activate switches. Created by left-clicking a switch with an Ender pearl.\n[A] Added switch linking of pulse and bi-stable switches. Both can be link sources and link targets.\n[A] Added switch linking of contact switches. All can be link sources, the shock-sensitive trapdoor switch can be source and target (only the most insensitive one).\n[A] Added switch linking of automatic switches. All can be link sources, except the interval timer, which can be a link target.\n[A] Added switch link trigger configurations: default trigger, source activation trigger, source deactivation trigger, and source toggle trigger.\n[M] Interval timer start condition consistency fixed (from standby to run mode the switch resets internal values).\n[F] Interval timer output inversion corrected to be not affected by standby/run state.",
    "1.0.4": "[R] Release based on v1.0.4b2.",
    "1.0.4-b2": "[A] Added industrial shock sensitive contact mat (pulses when something falls upon).\n[A] Added rustic shock sensitive contact plate (pulses when fallen upon).\n[A] Added industrial and rustic trapdoor switch (opens and pulses when fallen upon).\n[A] Added industrial and rustic high sensitive trapdoor switch (opens and pulses when fallen upon or walked on, except when sneaking).\n[A] Added industrial and rustic counter trapdoor switch (pulses when items or any entities fall through).",
    "1.0.4-b1": "[A] Added switch status message overlay (replaces chat messages).\n[A] Added industrial shock sensor contact mat (fall-on detector).\n[A] Added rustic full size contact plate.\n[M] Double click switch config shows the current config at the first double click, after that the config is cycled. Added this because the standard use case is to first inspect the config and then optionally change it.\n[M] Block-pop-off-check for gauges and switches check for AIR and any liquid now, not just for air, water, lava.\n[M] Light values of indicators reduced (LEDs to 2), only dynamic on client, constant on server. Reduces server re- calculations, but has the drawback that light-level-overlay shows not the same values on the client as used on the server.\n[M] Improved local light sensor autoswitch: Initial threshold values 7(on) and 6(off), fitting to spawn risk values. If on- and off-threshold are the same, the switch now activates on exactly that light level.\n[F] Redstone dust tracks don't show connections to wall-mount switches.\n[M] Switches are attachable to pistons, and pop off when pushed.\n[A] Implemented localisation support (some open tasks left, like localized day time representation of the timer clock; and seconds of the interval timers are arabic numbers because localisation files do not support %.02f format etc.). German language file updated.\n[M] Changed sensitive glass dynamic light level mod config to constant light level config for the server, means it is opt-in now, not opt-out. Reason is to priorise correct light-level- overlay over performance tuning.",
    "1.0.3": "[R] Release based on v1.0.3b6.",
    "1.0.3-b6": "[A] Added inverted redstone sensitive glass (light emitting).\n[A] Added touch configurable glass contact plate.\n[A] Added glass infrared motion detector.\n[A] Added glass linear laser detector.\n[A] Added glass daytime switch.\n[A] Added glass interval timer switch.\n[M] Enabled glass switch color teaching (dye-left-click-tinting).\n[M] Updated language files (Chinese prepared, still contains English words).",
    "1.0.3-b5": "[A] Added Chinese language file (thanks to sfchipan for the pull request on github)\n[A] Added German language file, too.\n[A] Fixed server startup crash issue due to color handler event subscription, which is unfortunately client side only. Thanks to Dave for posting this on github (issue #6).",
    "1.0.3-b4": "[A] Added glass bi-stable, pulse, and contact switches.\n[M] Changed sensitive glass textures.\n[M] Improved configuration based block/item block initialisation (backend).\n[A] Implemented unified switch color tinting support (backend)\n[A] Implemented unified switch light emission support (backend)",
    "1.0.3-b3": "[A] Added stained redstone sensitive glass blocks, changing from clear to stained-colored, but do not emit light as the clear sensitive glass block.",
    "1.0.3-b2": "[A] Added mod specific creative tab.\n[A] Added rustic floor contact switch UI texture.\n[A] Added switch left-click option 'no output' (default disabled in mod options, feature for future use).\n[M] Improved industrial bi-stable switch 1 model.\n[M] Changed multi-left-click config (weak/inverted): Now double-click for each step.",
    "1.0.3-b1": "[A] Added rustic wall gauge.\n[A] Added exact pulse switch off-timing using redstone-dust left-clicking.\n[M] Improved industrial gauge models.",
    "1.0.2": "[R] Release based on v1.0.2b2.",
    "1.0.2-b2": "[A] Added \"rustic\" switch series switches.",
    "1.0.2-b1": "[A] Added \"old fancy\" switch series.\n[A] Added \"rustic\" switch series (partial).\n[F] Fixed automatic switch iterative recipe.\n[F] Fixed version update bug (switchtileentity.reset() recursion), thanks to @tenosko.\n[M] Changed sensitive glass recipe.",
    "1.0.1": "[R] Release based on v1.0.1b3.",
    "1.0.1-b3": "[A] Added local light sensor switch.\n[A] Added rain sensor switch.\n[A] Added lightning potential sensor switch.\n[A] Added (day) timer clock.\n[A] Added interval timer.\n[M] Changed multi-left-click config default timeout from 1200ms to 700ms.\n[A] Prepared translation/localisation for text messages.",
    "1.0.1-b2": "[A] Added bistable mechanical/retro style hopper blocker switch.\n[A] Added bistable mechanical/retro style rotary lever switch.\n[A] Added bistable mechanical/retro style lever switch.\n[A] Added pulse mechanical/retro style pull switch.\n[A] Added pulse mechanical/retro style push switch.\n[A] Added pulse mechanical/retro style double pole push switch.\n[A] Added power state dependent construction time bounding box definitions for switches.\n[M] Changed recipe order for light flip switch (to end of style selection list).\n[M] Changed ring-fenced-pulse-switch front texture.\n[F] Fixed localisation name of arrow target pulse switch.\n[F] Fixed texture bleeding, UV scaling, and bounding box of the alarm siren.",
    "1.0.1-b1": "[A] Added configurable infrared motion sensor (volume range automatic switch).\n[A] Added configurable sensor (linear range automatic switch).\n[A] Added configurable door contact mat.\n[A] Added sensitive floor contact mat.\n[A] Added fenced pulse switch.\n[A] Added arrow target pulse switch.\n[A] Added alarm siren (sound indicator).\n[A] Added redstone sensitive glass (color change black->white, light source).\n[A] Added feature to switches: Empty handed multi-leftclick cycles through (strong -> weak -> weak inverted -> strong inverted -> strong etc).\n[A] Added: Door contact mat, infrared and laser sensor have a keypad to configure range/sensitivity, entity type (all, players, mobs, villagers, animals, objects, etc), entity count threshold, and output redstone power.\n[A] Added: Machine pulse switch can be activated with projectiles (but not the fenced one).\n[A] Added: ESTOP switch can be switched off with projectiles, but not on.\n[A] Added: Sensitive contact mat reacts to hitting projectiles and objects dropped on.",
    "1.0.0": "[R] Release based on v1.0.0rc4.\n[M] Final recipe tuning (gauge and lamp indicator).",
    "1.0.0-rc4": "[M] Performance improvements, startup screen config options added.\n[F] Fix: Network client: Gauge display zero when hit or activated.",
    "1.0.0-rc3": "[F] Fix: Tile entity based gauge handling to prevent display glitches on network clients.",
    "1.0.0-rc2": "[F] Fix: Server based gauge processing to measure indirect weak power.",
    "1.0.0-rc1": "[A] Initial feature complete version."
  },
  "1.14.4": {
    "1.1.8-b2": "[U] Updated to Forge 1.14.4-28.0.81/20190719-1.14.3, recipe condition processing adapted accordingly.",
    "1.1.8-b1": "[F] Fixed contact switch sound issue.\n[A] Added right-click switch configuration with Redstone Dust, Ender Pearl or Switch Link Pearl.\n[M] Industrial door contact mat model changed.\n[M] Industrial sensitive contact mat model changed.\n[M] Industrial shock sensitive contact mat model changed.\n[M] Industrial cased link receiver models changed.\n[M] Industrial block detector model changed.\n[M] Industrial trapdoor switch models changed.\n[M] Industrial dimmer model changed.",
    "1.1.7-b2": "[A] Entity detectors have configurable pulse time.\n[M] Industrial bistable switch model changes ported from 1.12.",
    "1.1.6-b1": "[A] Color tint support of gauges, glass switches, and sensitive glass ported.\n[M] Block detector switch patterns support tags.",
    "1.1.5-b1": "[A] Initial 1.12.2 to 1.14.4 port of all features except color tinting and Forge ore dictionary dependent blocks."
  }
}